// Створити функцію multiple() яка може приймати не обмежену кількість аргументів, та перемножує їх



// Створити фунцію reverseString яка приймає 1 аргумент будь-якого типу, і розвертає його. Наприклад: ‘test’ -> `tset`, undefined -> ‘denifednu’


// Створити фунцію вгадати число. Умови:
// Приймає число від 1-10. Перевірити що число не більше 10 і не менше 0, 
// якщо не відповідає повернути помилку new Error(‘Please provide number in range 0 - 10’)
// Якщо передали не число. Помилка return new Error(“Please provide a valid number”);
// Далі функція генерує рандомне число від 1 до 10 і якщо задане число правильне повертає стрінгу ‘You Win!’, 
// якщо не правильно ‘You are lose, your number is 8, the random number is 5’




// Є масив чисел (додатних, відʼємних, і впереміш). Потрібно знайти min, max, sum. Не можна використовувати методи масивів або обʼєкту Math, а тільки цикли for і while. Приклади масивів:
// [3,0,-5,1,44,-12,3,0,0,1,2,-3,-3,2,1,4,-2-3-1]
// [-1,-8,-2]
// [1,7,3]
// [1,undefined,3,5,-3]
// [1,NaN,3,5,-3]


// https://docs.google.com/spreadsheets/d/1CC5nWd3HgY0cBi_1fw0hvrhyintW1X6O42XMVDUr5v8/edit?usp=sharing
// Приклади:
// // [2, 5, 1, 3, 1, 2, 1, 7, 7, 6]; // 17
// // [2, 1, 5, 0, 3, 4, 7, 2, 3, 1, 0]; // 10
// // [7, 0, 1, 3, 4, 1, 2, 1] // 9
// // [2, 1, 5, 0, 3, 4, 7, 2, 3, 1, 0] // 10
// // [2, 2, 1, 2, 2, 3, 0, 1, 2] // 4
// // [2, 1, 5, 0, 3, 4, 7, 2, 3, 1, 8] // 24
// // [2, 2, 2, 2, 2] // 0